[
    
    {
        "title": "Cloud Networking Engineer: Intern Opportunities for University Graduates ",
        "description":"Develops knowledge of network technologies to draw insights that aid in network design, implementation, and operation. Assists in the design of reliable, scalable, and high-performance network features or components with guidance from other engineers. Monitors network telemetry and performs basic analyses to triangulate failures, with guidance from other engineers; makes suggestions on possible improvements to monitoring based on observations. Contributes to testing and validation of network devices, firmware, and configurations; defines and implements test cases with existing automation tools. Contributes to the development or modification of network automation tools with guidance from other engineers to make efficient use of infrastructure and resources by automating performance of various tasks related to network operations, testing, and incident management. Works within a team of engineers to manage network deployments; works with a machine-readable definition of the network deployment.",
        "requirements": "Pursuing a bachelor’s degree in Electrical Engineering, Optical Engineering, Computer Science, Engineering, Information Technology, or related field. OR technical experience in network design, development, or automation Must have at least one additional quarter/semester of school remaining following the completion of the internship",
        "employer":"Microsoft",
        "type": "Internship for Cloud Engineering"
    },

    {

        "title": "Data Scientist",
        "description":"You will be faced with a variety of problems to solve, and you will be equipped with strong analytical and quantitative skills to take on these of challenges in sophisticated environments. Your creativity and critical thinking skills will be put to good use, deconstructing problems and transforming your insights into data backed recommendations. In this role, you will perform the following: Work with large volumes of data; extract and manipulate large datasets using tools such as Spark SQL, command line and scripting languages. Analyze data covering a wide range of information from user profile to user behavior signals and identify new engagement patterns through data mining Conduct hypothesis driven exploratory analysis, build feature engineering, design the best structure, and select the most appropriate modeling techniques from a variety of machine learning models.  Design, develop, validate and maintain big data-driven predictive models, tools and pipelines to improve user engagement using latest technologies in machine learning, user pattern recognition, and data modeling based on user lifecycle events. Research and prototype supervised and unsupervised machine learning solutions to a variety of problems using both structured and unstructured data Collaborate with product, engineering, business groups to translate a business question to a data science problem and formulate innovative solutions to experiment and implement advanced data mining techniques.  Communicate complex concepts and the results of the analyses in a clear and effective manner to senior management.",
        "requirements": "You have superb coding skills and hands-on experience with Big Data. You are proficient in writing code in one of the following languages: Python, R, Java, Perl, in addition to Hadoop experience (MapReduce, Hive, Spark SQL), and SQL. You have strong product intuition, data analysis skills, as well as business presentation skills to share your findings. You work comfortably with large sets of data using groundbreaking tools. You have a deep understanding of predictive modeling and algorithms for classification, regression, clustering, and anomaly detection. You have practical experience solving real-world problems using creative methods and researching state-of-the art. You are delivery-oriented, able to lead and execute modeling efforts from start to finish. Above all, we are seeking a phenomenal teammate with excellent interpersonal skills, and a self-starter.",
        "employer":"Apple",
        "type": "Data Science"
    },
    {

        "title": "Software Engineer, Linux Update Systems",
        "description":"The Update Systems teams builds and maintains the Linux services that perform the Over-the-Air (OTA) update of Tesla's vehicle and energy products spanning across both our customer and engineering fleets. In addition to infotainment and autopilot software updates, our systems orchestrate the update of a wide array of other components ranging from individual body controllers to navigation map data and video games. We work closely with several other teams to provide a fast, flexible, and reliable update platform to ensure Tesla products can improve quickly and deliver new experiences to our customers. What You’ll Do:  Deliver high reliability C/Go code for updating firmware or software components on Linux hosts or attached peripherals. Work with a variety of teams to design, develop, and integrate new software update mechanisms and flow. Troubleshoot update issues and work closely with our validation teams to build testing infrastructure for more resilient systems. Analyze fleet update metrics to find potential issues and suggest improvements.",
        "requirements": "Qualified in EE/CE/CS, or the equivalent in experience with evidence of exceptional ability. Several years of experience working with and writing software for embedded Linux systems; experience with software/kernel updates is plus. Proficiency in C/Go Programming, experience in Python/Perl/Bash scripting. Understanding of software code signing, authenticated encryption, or other cryptographic techniques for ensuring secure software deployment. Excellent debugging and troubleshooting skills. Network programming experience with a focus on any of the following: TFTP, HTTP(s), websockets, or integrating custom TCP/IP protocols. Experience with serial, I2C, and SPI protocols is a plus.",
        "employer":"Tesla",
        "type": "Software Engineer"  
    }
]